avrdudes/avr-libc/include/avr/ioavr128da48s.h
/* Channel 5 generator select bit group values */
typedef enum EVSYS_CHANNEL5_VALUES_enum
{
    EVSYS_CHANNEL5_OFF_gv          = 0x00,  /* Off */
    EVSYS_CHANNEL5_UPDI_SYNCH_gv   = 0x01,  /* UPDI SYNCH character */
    EVSYS_CHANNEL5_RTC_OVF_gv      = 0x06,  /* Real Time Counter overflow */
    EVSYS_CHANNEL5_RTC_CMP_gv      = 0x07,  /* Real Time Counter compare */
    EVSYS_CHANNEL5_RTC_PIT_DIV512_gv = 0x08,  /* Periodic Interrupt Timer output 0 */
    EVSYS_CHANNEL5_RTC_PIT_DIV256_gv = 0x09,  /* Periodic Interrupt Timer output 1 */
    EVSYS_CHANNEL5_RTC_PIT_DIV128_gv = 0x0A,  /* Periodic Interrupt Timer output 2 */
    EVSYS_CHANNEL5_RTC_PIT_DIV64_gv = 0x0B,  /* Periodic Interrupt Timer output 3 */
    EVSYS_CHANNEL5_CCL_LUT0_gv     = 0x10,  /* Configurable Custom Logic LUT0 */
    EVSYS_CHANNEL5_CCL_LUT1_gv     = 0x11,  /* Configurable Custom Logic LUT1 */
    EVSYS_CHANNEL5_CCL_LUT2_gv     = 0x12,  /* Configurable Custom Logic LUT2 */
    EVSYS_CHANNEL5_CCL_LUT3_gv     = 0x13,  /* Configurable Custom Logic LUT3 */
    EVSYS_CHANNEL5_CCL_LUT4_gv     = 0x14,  /* Configurable Custom Logic LUT4 */
    EVSYS_CHANNEL5_CCL_LUT5_gv     = 0x15,  /* Configurable Custom Logic LUT5 */
    EVSYS_CHANNEL5_AC0_OUT_gv      = 0x20,  /* Analog Comparator 0 out */
    EVSYS_CHANNEL5_AC1_OUT_gv      = 0x21,  /* Analog Comparator 1 out */
    EVSYS_CHANNEL5_AC2_OUT_gv      = 0x22,  /* Analog Comparator 2 out */
    EVSYS_CHANNEL5_ADC0_RESRDY_gv  = 0x24,  /* ADC 0 Result Ready */
    EVSYS_CHANNEL5_PTC_RESRDY_gv   = 0x28,  /* PTC Result Ready */
    EVSYS_CHANNEL5_ZCD0_gv         = 0x30,  /* Zero Cross Detect 0 out */
    EVSYS_CHANNEL5_ZCD1_gv         = 0x31,  /* Zero Cross Detect 1 out */
    EVSYS_CHANNEL5_PORTE_PIN0_gv   = 0x40,  /* Port E Pin 0 */
    EVSYS_CHANNEL5_PORTE_PIN1_gv   = 0x41,  /* Port E Pin 1 */
    EVSYS_CHANNEL5_PORTE_PIN2_gv   = 0x42,  /* Port E Pin 2 */
    EVSYS_CHANNEL5_PORTE_PIN3_gv   = 0x43,  /* Port E Pin 3 */
    EVSYS_CHANNEL5_PORTF_PIN0_gv   = 0x48,  /* Port F Pin 0 */
    EVSYS_CHANNEL5_PORTF_PIN1_gv   = 0x49,  /* Port F Pin 1 */
    EVSYS_CHANNEL5_PORTF_PIN2_gv   = 0x4A,  /* Port F Pin 2 */
    EVSYS_CHANNEL5_PORTF_PIN3_gv   = 0x4B,  /* Port F Pin 3 */
    EVSYS_CHANNEL5_PORTF_PIN4_gv   = 0x4C,  /* Port F Pin 4 */
    EVSYS_CHANNEL5_PORTF_PIN5_gv   = 0x4D,  /* Port F Pin 5 */
    EVSYS_CHANNEL5_PORTF_PIN6_gv   = 0x4E,  /* Port F Pin 6 */
    EVSYS_CHANNEL5_USART0_XCK_gv   = 0x60,  /* USART 0 XCK */
    EVSYS_CHANNEL5_USART1_XCK_gv   = 0x61,  /* USART 1 XCK */
    EVSYS_CHANNEL5_USART2_XCK_gv   = 0x62,  /* USART 2 XCK */
    EVSYS_CHANNEL5_USART3_XCK_gv   = 0x63,  /* USART 3 XCK */
    EVSYS_CHANNEL5_USART4_XCK_gv   = 0x64,  /* USART 4 XCK */
    EVSYS_CHANNEL5_SPI0_SCK_gv     = 0x68,  /* SPI 0 SCK */
    EVSYS_CHANNEL5_SPI1_SCK_gv     = 0x69,  /* SPI 1 SCK */
    EVSYS_CHANNEL5_TCA0_OVF_LUNF_gv = 0x80,  /* Timer/Counter A0 overflow / low byte timer underflow */
    EVSYS_CHANNEL5_TCA0_HUNF_gv    = 0x81,  /* Timer/Counter A0 high byte timer underflow */
    EVSYS_CHANNEL5_TCA0_CMP0_LCMP0_gv = 0x84,  /* Timer/Counter A0 compare 0 / low byte timer compare 0 */
    EVSYS_CHANNEL5_TCA0_CMP1_LCMP1_gv = 0x85,  /* Timer/Counter A0 compare 1 / low byte timer compare 1 */
    EVSYS_CHANNEL5_TCA0_CMP2_LCMP2_gv = 0x86,  /* Timer/Counter A0 compare 2 / low byte timer compare 2 */
    EVSYS_CHANNEL5_TCA1_OVF_LUNF_gv = 0x88,  /* Timer/Counter A1 overflow / low byte timer underflow */
    EVSYS_CHANNEL5_TCA1_HUNF_gv    = 0x89,  /* Timer/Counter A1 high byte timer underflow */
    EVSYS_CHANNEL5_TCA1_CMP0_LCMP0_gv = 0x8C,  /* Timer/Counter A1 compare 0 / low byte timer compare 0 */
    EVSYS_CHANNEL5_TCA1_CMP1_LCMP1_gv = 0x8D,  /* Timer/Counter A1 compare 1 / low byte timer compare 1 */
    EVSYS_CHANNEL5_TCA1_CMP2_LCMP2_gv = 0x8E,  /* Timer/Counter A1 compare 2 / low byte timer compare 2 */
    EVSYS_CHANNEL5_TCB0_CAPT_gv    = 0xA0,  /* Timer/Counter B0 capture */
    EVSYS_CHANNEL5_TCB0_OVF_gv     = 0xA1,  /* Timer/Counter B0 overflow */
    EVSYS_CHANNEL5_TCB1_CAPT_gv    = 0xA2,  /* Timer/Counter B1 capture */
    EVSYS_CHANNEL5_TCB1_OVF_gv     = 0xA3,  /* Timer/Counter B1 overflow */
    EVSYS_CHANNEL5_TCB2_CAPT_gv    = 0xA4,  /* Timer/Counter B2 capture */
    EVSYS_CHANNEL5_TCB2_OVF_gv     = 0xA5,  /* Timer/Counter B2 overflow */
    EVSYS_CHANNEL5_TCB3_CAPT_gv    = 0xA6,  /* Timer/Counter B3 capture */
    EVSYS_CHANNEL5_TCB3_OVF_gv     = 0xA7,  /* Timer/Counter B3 overflow */
    EVSYS_CHANNEL5_TCD0_CMPBCLR_gv = 0xB0,  /* Timer/Counter D0 event 0 */
    EVSYS_CHANNEL5_TCD0_CMPASET_gv = 0xB1,  /* Timer/Counter D0 event 1 */
    EVSYS_CHANNEL5_TCD0_CMPBSET_gv = 0xB2,  /* Timer/Counter D0 event 2 */
    EVSYS_CHANNEL5_TCD0_PROGEV_gv  = 0xB3   /* Timer/Counter D0 event 3 */
} EVSYS_CHANNEL5_values_t;

/* Channel 5 generator select bit group configurations*/
typedef enum EVSYS_CHANNEL5_enum
{
    EVSYS_CHANNEL5_OFF_gc          = (EVSYS_CHANNEL5_OFF_gv << EVSYS_CHANNEL5_gp),  /* Off */
    EVSYS_CHANNEL5_UPDI_SYNCH_gc   = (EVSYS_CHANNEL5_UPDI_SYNCH_gv << EVSYS_CHANNEL5_gp),  /* UPDI SYNCH character */
    EVSYS_CHANNEL5_RTC_OVF_gc      = (EVSYS_CHANNEL5_RTC_OVF_gv << EVSYS_CHANNEL5_gp),  /* Real Time Counter overflow */
    EVSYS_CHANNEL5_RTC_CMP_gc      = (EVSYS_CHANNEL5_RTC_CMP_gv << EVSYS_CHANNEL5_gp),  /* Real Time Counter compare */
    EVSYS_CHANNEL5_RTC_PIT_DIV512_gc = (EVSYS_CHANNEL5_RTC_PIT_DIV512_gv << EVSYS_CHANNEL5_gp),  /* Periodic Interrupt Timer output 0 */
    EVSYS_CHANNEL5_RTC_PIT_DIV256_gc = (EVSYS_CHANNEL5_RTC_PIT_DIV256_gv << EVSYS_CHANNEL5_gp),  /* Periodic Interrupt Timer output 1 */
    EVSYS_CHANNEL5_RTC_PIT_DIV128_gc = (EVSYS_CHANNEL5_RTC_PIT_DIV128_gv << EVSYS_CHANNEL5_gp),  /* Periodic Interrupt Timer output 2 */
    EVSYS_CHANNEL5_RTC_PIT_DIV64_gc = (EVSYS_CHANNEL5_RTC_PIT_DIV64_gv << EVSYS_CHANNEL5_gp),  /* Periodic Interrupt Timer output 3 */
    EVSYS_CHANNEL5_CCL_LUT0_gc     = (EVSYS_CHANNEL5_CCL_LUT0_gv << EVSYS_CHANNEL5_gp),  /* Configurable Custom Logic LUT0 */
    EVSYS_CHANNEL5_CCL_LUT1_gc     = (EVSYS_CHANNEL5_CCL_LUT1_gv << EVSYS_CHANNEL5_gp),  /* Configurable Custom Logic LUT1 */
    EVSYS_CHANNEL5_CCL_LUT2_gc     = (EVSYS_CHANNEL5_CCL_LUT2_gv << EVSYS_CHANNEL5_gp),  /* Configurable Custom Logic LUT2 */
    EVSYS_CHANNEL5_CCL_LUT3_gc     = (EVSYS_CHANNEL5_CCL_LUT3_gv << EVSYS_CHANNEL5_gp),  /* Configurable Custom Logic LUT3 */
    EVSYS_CHANNEL5_CCL_LUT4_gc     = (EVSYS_CHANNEL5_CCL_LUT4_gv << EVSYS_CHANNEL5_gp),  /* Configurable Custom Logic LUT4 */
    EVSYS_CHANNEL5_CCL_LUT5_gc     = (EVSYS_CHANNEL5_CCL_LUT5_gv << EVSYS_CHANNEL5_gp),  /* Configurable Custom Logic LUT5 */
    EVSYS_CHANNEL5_AC0_OUT_gc      = (EVSYS_CHANNEL5_AC0_OUT_gv << EVSYS_CHANNEL5_gp),  /* Analog Comparator 0 out */
    EVSYS_CHANNEL5_AC1_OUT_gc      = (EVSYS_CHANNEL5_AC1_OUT_gv << EVSYS_CHANNEL5_gp),  /* Analog Comparator 1 out */
    EVSYS_CHANNEL5_AC2_OUT_gc      = (EVSYS_CHANNEL5_AC2_OUT_gv << EVSYS_CHANNEL5_gp),  /* Analog Comparator 2 out */
    EVSYS_CHANNEL5_ADC0_RESRDY_gc  = (EVSYS_CHANNEL5_ADC0_RESRDY_gv << EVSYS_CHANNEL5_gp),  /* ADC 0 Result Ready */
    EVSYS_CHANNEL5_PTC_RESRDY_gc   = (EVSYS_CHANNEL5_PTC_RESRDY_gv << EVSYS_CHANNEL5_gp),  /* PTC Result Ready */
    EVSYS_CHANNEL5_ZCD0_gc         = (EVSYS_CHANNEL5_ZCD0_gv << EVSYS_CHANNEL5_gp),  /* Zero Cross Detect 0 out */
    EVSYS_CHANNEL5_ZCD1_gc         = (EVSYS_CHANNEL5_ZCD1_gv << EVSYS_CHANNEL5_gp),  /* Zero Cross Detect 1 out */
    EVSYS_CHANNEL5_PORTE_PIN0_gc   = (EVSYS_CHANNEL5_PORTE_PIN0_gv << EVSYS_CHANNEL5_gp),  /* Port E Pin 0 */
    EVSYS_CHANNEL5_PORTE_PIN1_gc   = (EVSYS_CHANNEL5_PORTE_PIN1_gv << EVSYS_CHANNEL5_gp),  /* Port E Pin 1 */
    EVSYS_CHANNEL5_PORTE_PIN2_gc   = (EVSYS_CHANNEL5_PORTE_PIN2_gv << EVSYS_CHANNEL5_gp),  /* Port E Pin 2 */
    EVSYS_CHANNEL5_PORTE_PIN3_gc   = (EVSYS_CHANNEL5_PORTE_PIN3_gv << EVSYS_CHANNEL5_gp),  /* Port E Pin 3 */
    EVSYS_CHANNEL5_PORTF_PIN0_gc   = (EVSYS_CHANNEL5_PORTF_PIN0_gv << EVSYS_CHANNEL5_gp),  /* Port F Pin 0 */
    EVSYS_CHANNEL5_PORTF_PIN1_gc   = (EVSYS_CHANNEL5_PORTF_PIN1_gv << EVSYS_CHANNEL5_gp),  /* Port F Pin 1 */
    EVSYS_CHANNEL5_PORTF_PIN2_gc   = (EVSYS_CHANNEL5_PORTF_PIN2_gv << EVSYS_CHANNEL5_gp),  /* Port F Pin 2 */
    EVSYS_CHANNEL5_PORTF_PIN3_gc   = (EVSYS_CHANNEL5_PORTF_PIN3_gv << EVSYS_CHANNEL5_gp),  /* Port F Pin 3 */
    EVSYS_CHANNEL5_PORTF_PIN4_gc   = (EVSYS_CHANNEL5_PORTF_PIN4_gv << EVSYS_CHANNEL5_gp),  /* Port F Pin 4 */
    EVSYS_CHANNEL5_PORTF_PIN5_gc   = (EVSYS_CHANNEL5_PORTF_PIN5_gv << EVSYS_CHANNEL5_gp),  /* Port F Pin 5 */
    EVSYS_CHANNEL5_PORTF_PIN6_gc   = (EVSYS_CHANNEL5_PORTF_PIN6_gv << EVSYS_CHANNEL5_gp),  /* Port F Pin 6 */
    EVSYS_CHANNEL5_USART0_XCK_gc   = (EVSYS_CHANNEL5_USART0_XCK_gv << EVSYS_CHANNEL5_gp),  /* USART 0 XCK */
    EVSYS_CHANNEL5_USART1_XCK_gc   = (EVSYS_CHANNEL5_USART1_XCK_gv << EVSYS_CHANNEL5_gp),  /* USART 1 XCK */
    EVSYS_CHANNEL5_USART2_XCK_gc   = (EVSYS_CHANNEL5_USART2_XCK_gv << EVSYS_CHANNEL5_gp),  /* USART 2 XCK */
    EVSYS_CHANNEL5_USART3_XCK_gc   = (EVSYS_CHANNEL5_USART3_XCK_gv << EVSYS_CHANNEL5_gp),  /* USART 3 XCK */
    EVSYS_CHANNEL5_USART4_XCK_gc   = (EVSYS_CHANNEL5_USART4_XCK_gv << EVSYS_CHANNEL5_gp),  /* USART 4 XCK */
    EVSYS_CHANNEL5_SPI0_SCK_gc     = (EVSYS_CHANNEL5_SPI0_SCK_gv << EVSYS_CHANNEL5_gp),  /* SPI 0 SCK */
    EVSYS_CHANNEL5_SPI1_SCK_gc     = (EVSYS_CHANNEL5_SPI1_SCK_gv << EVSYS_CHANNEL5_gp),  /* SPI 1 SCK */
    EVSYS_CHANNEL5_TCA0_OVF_LUNF_gc = (EVSYS_CHANNEL5_TCA0_OVF_LUNF_gv << EVSYS_CHANNEL5_gp),  /* Timer/Counter A0 overflow / low byte timer underflow */
    EVSYS_CHANNEL5_TCA0_HUNF_gc    = (EVSYS_CHANNEL5_TCA0_HUNF_gv << EVSYS_CHANNEL5_gp),  /* Timer/Counter A0 high byte timer underflow */
    EVSYS_CHANNEL5_TCA0_CMP0_LCMP0_gc = (EVSYS_CHANNEL5_TCA0_CMP0_LCMP0_gv << EVSYS_CHANNEL5_gp),  /* Timer/Counter A0 compare 0 / low byte timer compare 0 */
    EVSYS_CHANNEL5_TCA0_CMP1_LCMP1_gc = (EVSYS_CHANNEL5_TCA0_CMP1_LCMP1_gv << EVSYS_CHANNEL5_gp),  /* Timer/Counter A0 compare 1 / low byte timer compare 1 */
    EVSYS_CHANNEL5_TCA0_CMP2_LCMP2_gc = (EVSYS_CHANNEL5_TCA0_CMP2_LCMP2_gv << EVSYS_CHANNEL5_gp),  /* Timer/Counter A0 compare 2 / low byte timer compare 2 */
    EVSYS_CHANNEL5_TCA1_OVF_LUNF_gc = (EVSYS_CHANNEL5_TCA1_OVF_LUNF_gv << EVSYS_CHANNEL5_gp),  /* Timer/Counter A1 overflow / low byte timer underflow */
    EVSYS_CHANNEL5_TCA1_HUNF_gc    = (EVSYS_CHANNEL5_TCA1_HUNF_gv << EVSYS_CHANNEL5_gp),  /* Timer/Counter A1 high byte timer underflow */
    EVSYS_CHANNEL5_TCA1_CMP0_LCMP0_gc = (EVSYS_CHANNEL5_TCA1_CMP0_LCMP0_gv << EVSYS_CHANNEL5_gp),  /* Timer/Counter A1 compare 0 / low byte timer compare 0 */
    EVSYS_CHANNEL5_TCA1_CMP1_LCMP1_gc = (EVSYS_CHANNEL5_TCA1_CMP1_LCMP1_gv << EVSYS_CHANNEL5_gp),  /* Timer/Counter A1 compare 1 / low byte timer compare 1 */
    EVSYS_CHANNEL5_TCA1_CMP2_LCMP2_gc = (EVSYS_CHANNEL5_TCA1_CMP2_LCMP2_gv << EVSYS_CHANNEL5_gp),  /* Timer/Counter A1 compare 2 / low byte timer compare 2 */
    EVSYS_CHANNEL5_TCB0_CAPT_gc    = (EVSYS_CHANNEL5_TCB0_CAPT_gv << EVSYS_CHANNEL5_gp),  /* Timer/Counter B0 capture */
    EVSYS_CHANNEL5_TCB0_OVF_gc     = (EVSYS_CHANNEL5_TCB0_OVF_gv << EVSYS_CHANNEL5_gp),  /* Timer/Counter B0 overflow */
    EVSYS_CHANNEL5_TCB1_CAPT_gc    = (EVSYS_CHANNEL5_TCB1_CAPT_gv << EVSYS_CHANNEL5_gp),  /* Timer/Counter B1 capture */
    EVSYS_CHANNEL5_TCB1_OVF_gc     = (EVSYS_CHANNEL5_TCB1_OVF_gv << EVSYS_CHANNEL5_gp),  /* Timer/Counter B1 overflow */
    EVSYS_CHANNEL5_TCB2_CAPT_gc    = (EVSYS_CHANNEL5_TCB2_CAPT_gv << EVSYS_CHANNEL5_gp),  /* Timer/Counter B2 capture */
    EVSYS_CHANNEL5_TCB2_OVF_gc     = (EVSYS_CHANNEL5_TCB2_OVF_gv << EVSYS_CHANNEL5_gp),  /* Timer/Counter B2 overflow */
    EVSYS_CHANNEL5_TCB3_CAPT_gc    = (EVSYS_CHANNEL5_TCB3_CAPT_gv << EVSYS_CHANNEL5_gp),  /* Timer/Counter B3 capture */
    EVSYS_CHANNEL5_TCB3_OVF_gc     = (EVSYS_CHANNEL5_TCB3_OVF_gv << EVSYS_CHANNEL5_gp),  /* Timer/Counter B3 overflow */
    EVSYS_CHANNEL5_TCD0_CMPBCLR_gc = (EVSYS_CHANNEL5_TCD0_CMPBCLR_gv << EVSYS_CHANNEL5_gp),  /* Timer/Counter D0 event 0 */
    EVSYS_CHANNEL5_TCD0_CMPASET_gc = (EVSYS_CHANNEL5_TCD0_CMPASET_gv << EVSYS_CHANNEL5_gp),  /* Timer/Counter D0 event 1 */
    EVSYS_CHANNEL5_TCD0_CMPBSET_gc = (EVSYS_CHANNEL5_TCD0_CMPBSET_gv << EVSYS_CHANNEL5_gp),  /* Timer/Counter D0 event 2 */
    EVSYS_CHANNEL5_TCD0_PROGEV_gc  = (EVSYS_CHANNEL5_TCD0_PROGEV_gv << EVSYS_CHANNEL5_gp)   /* Timer/Counter D0 event 3 */
} EVSYS_CHANNEL5_t;

/* Channel 6 generator select bit group values */
typedef enum EVSYS_CHANNEL6_VALUES_enum
{
    EVSYS_CHANNEL6_OFF_gv          = 0x00,  /* Off */
    EVSYS_CHANNEL6_UPDI_SYNCH_gv   = 0x01,  /* UPDI SYNCH character */
    EVSYS_CHANNEL6_RTC_OVF_gv      = 0x06,  /* Real Time Counter overflow */
    EVSYS_CHANNEL6_RTC_CMP_gv      = 0x07,  /* Real Time Counter compare */
    EVSYS_CHANNEL6_RTC_PIT_DIV8192_gv = 0x08,  /* Periodic Interrupt Timer output 0 */
    EVSYS_CHANNEL6_RTC_PIT_DIV4096_gv = 0x09,  /* Periodic Interrupt Timer output 1 */
    EVSYS_CHANNEL6_RTC_PIT_DIV2048_gv = 0x0A,  /* Periodic Interrupt Timer output 2 */
    EVSYS_CHANNEL6_RTC_PIT_DIV1024_gv = 0x0B,  /* Periodic Interrupt Timer output 3 */
    EVSYS_CHANNEL6_CCL_LUT0_gv     = 0x10,  /* Configurable Custom Logic LUT0 */
    EVSYS_CHANNEL6_CCL_LUT1_gv     = 0x11,  /* Configurable Custom Logic LUT1 */
    EVSYS_CHANNEL6_CCL_LUT2_gv     = 0x12,  /* Configurable Custom Logic LUT2 */
    EVSYS_CHANNEL6_CCL_LUT3_gv     = 0x13,  /* Configurable Custom Logic LUT3 */
    EVSYS_CHANNEL6_CCL_LUT4_gv     = 0x14,  /* Configurable Custom Logic LUT4 */
    EVSYS_CHANNEL6_CCL_LUT5_gv     = 0x15,  /* Configurable Custom Logic LUT5 */
    EVSYS_CHANNEL6_AC0_OUT_gv      = 0x20,  /* Analog Comparator 0 out */
    EVSYS_CHANNEL6_AC1_OUT_gv      = 0x21,  /* Analog Comparator 1 out */
    EVSYS_CHANNEL6_AC2_OUT_gv      = 0x22,  /* Analog Comparator 2 out */
    EVSYS_CHANNEL6_ADC0_RESRDY_gv  = 0x24,  /* ADC 0 Result Ready */
    EVSYS_CHANNEL6_PTC_RESRDY_gv   = 0x28,  /* PTC Result Ready */
    EVSYS_CHANNEL6_ZCD0_gv         = 0x30,  /* Zero Cross Detect 0 out */
    EVSYS_CHANNEL6_ZCD1_gv         = 0x31,  /* Zero Cross Detect 1 out */
    EVSYS_CHANNEL6_USART0_XCK_gv   = 0x60,  /* USART 0 XCK */
    EVSYS_CHANNEL6_USART1_XCK_gv   = 0x61,  /* USART 1 XCK */
    EVSYS_CHANNEL6_USART2_XCK_gv   = 0x62,  /* USART 2 XCK */
    EVSYS_CHANNEL6_USART3_XCK_gv   = 0x63,  /* USART 3 XCK */
    EVSYS_CHANNEL6_USART4_XCK_gv   = 0x64,  /* USART 4 XCK */
    EVSYS_CHANNEL6_SPI0_SCK_gv     = 0x68,  /* SPI 0 SCK */
    EVSYS_CHANNEL6_SPI1_SCK_gv     = 0x69,  /* SPI 1 SCK */
    EVSYS_CHANNEL6_TCA0_OVF_LUNF_gv = 0x80,  /* Timer/Counter A0 overflow / low byte timer underflow */
    EVSYS_CHANNEL6_TCA0_HUNF_gv    = 0x81,  /* Timer/Counter A0 high byte timer underflow */
    EVSYS_CHANNEL6_TCA0_CMP0_LCMP0_gv = 0x84,  /* Timer/Counter A0 compare 0 / low byte timer compare 0 */
    EVSYS_CHANNEL6_TCA0_CMP1_LCMP1_gv = 0x85,  /* Timer/Counter A0 compare 1 / low byte timer compare 1 */
    EVSYS_CHANNEL6_TCA0_CMP2_LCMP2_gv = 0x86,  /* Timer/Counter A0 compare 2 / low byte timer compare 2 */
    EVSYS_CHANNEL6_TCA1_OVF_LUNF_gv = 0x88,  /* Timer/Counter A1 overflow / low byte timer underflow */
    EVSYS_CHANNEL6_TCA1_HUNF_gv    = 0x89,  /* Timer/Counter A1 high byte timer underflow */
    EVSYS_CHANNEL6_TCA1_CMP0_LCMP0_gv = 0x8C,  /* Timer/Counter A1 compare 0 / low byte timer compare 0 */
    EVSYS_CHANNEL6_TCA1_CMP1_LCMP1_gv = 0x8D,  /* Timer/Counter A1 compare 1 / low byte timer compare 1 */
    EVSYS_CHANNEL6_TCA1_CMP2_LCMP2_gv = 0x8E,  /* Timer/Counter A1 compare 2 / low byte timer compare 2 */
    EVSYS_CHANNEL6_TCB0_CAPT_gv    = 0xA0,  /* Timer/Counter B0 capture */
    EVSYS_CHANNEL6_TCB0_OVF_gv     = 0xA1,  /* Timer/Counter B0 overflow */
    EVSYS_CHANNEL6_TCB1_CAPT_gv    = 0xA2,  /* Timer/Counter B1 capture */
    EVSYS_CHANNEL6_TCB1_OVF_gv     = 0xA3,  /* Timer/Counter B1 overflow */
    EVSYS_CHANNEL6_TCB2_CAPT_gv    = 0xA4,  /* Timer/Counter B2 capture */
    EVSYS_CHANNEL6_TCB2_OVF_gv     = 0xA5,  /* Timer/Counter B2 overflow */
    EVSYS_CHANNEL6_TCB3_CAPT_gv    = 0xA6,  /* Timer/Counter B3 capture */
    EVSYS_CHANNEL6_TCB3_OVF_gv     = 0xA7,  /* Timer/Counter B3 overflow */
    EVSYS_CHANNEL6_TCD0_CMPBCLR_gv = 0xB0,  /* Timer/Counter D0 event 0 */
    EVSYS_CHANNEL6_TCD0_CMPASET_gv = 0xB1,  /* Timer/Counter D0 event 1 */
    EVSYS_CHANNEL6_TCD0_CMPBSET_gv = 0xB2,  /* Timer/Counter D0 event 2 */
    EVSYS_CHANNEL6_TCD0_PROGEV_gv  = 0xB3   /* Timer/Counter D0 event 3 */
} EVSYS_CHANNEL6_values_t;

/* Channel 6 generator select bit group configurations*/
typedef enum EVSYS_CHANNEL6_enum
{
    EVSYS_CHANNEL6_OFF_gc          = (EVSYS_CHANNEL6_OFF_gv << EVSYS_CHANNEL6_gp),  /* Off */
    EVSYS_CHANNEL6_UPDI_SYNCH_gc   = (EVSYS_CHANNEL6_UPDI_SYNCH_gv << EVSYS_CHANNEL6_gp),  /* UPDI SYNCH character */
    EVSYS_CHANNEL6_RTC_OVF_gc      = (EVSYS_CHANNEL6_RTC_OVF_gv << EVSYS_CHANNEL6_gp),  /* Real Time Counter overflow */
    EVSYS_CHANNEL6_RTC_CMP_gc      = (EVSYS_CHANNEL6_RTC_CMP_gv << EVSYS_CHANNEL6_gp),  /* Real Time Counter compare */
    EVSYS_CHANNEL6_RTC_PIT_DIV8192_gc = (EVSYS_CHANNEL6_RTC_PIT_DIV8192_gv << EVSYS_CHANNEL6_gp),  /* Periodic Interrupt Timer output 0 */
    EVSYS_CHANNEL6_RTC_PIT_DIV4096_gc = (EVSYS_CHANNEL6_RTC_PIT_DIV4096_gv << EVSYS_CHANNEL6_gp),  /* Periodic Interrupt Timer output 1 */
    EVSYS_CHANNEL6_RTC_PIT_DIV2048_gc = (EVSYS_CHANNEL6_RTC_PIT_DIV2048_gv << EVSYS_CHANNEL6_gp),  /* Periodic Interrupt Timer output 2 */
    EVSYS_CHANNEL6_RTC_PIT_DIV1024_gc = (EVSYS_CHANNEL6_RTC_PIT_DIV1024_gv << EVSYS_CHANNEL6_gp),  /* Periodic Interrupt Timer output 3 */
    EVSYS_CHANNEL6_CCL_LUT0_gc     = (EVSYS_CHANNEL6_CCL_LUT0_gv << EVSYS_CHANNEL6_gp),  /* Configurable Custom Logic LUT0 */
    EVSYS_CHANNEL6_CCL_LUT1_gc     = (EVSYS_CHANNEL6_CCL_LUT1_gv << EVSYS_CHANNEL6_gp),  /* Configurable Custom Logic LUT1 */
    EVSYS_CHANNEL6_CCL_LUT2_gc     = (EVSYS_CHANNEL6_CCL_LUT2_gv << EVSYS_CHANNEL6_gp),  /* Configurable Custom Logic LUT2 */
    EVSYS_CHANNEL6_CCL_LUT3_gc     = (EVSYS_CHANNEL6_CCL_LUT3_gv << EVSYS_CHANNEL6_gp),  /* Configurable Custom Logic LUT3 */
    EVSYS_CHANNEL6_CCL_LUT4_gc     = (EVSYS_CHANNEL6_CCL_LUT4_gv << EVSYS_CHANNEL6_gp),  /* Configurable Custom Logic LUT4 */
    EVSYS_CHANNEL6_CCL_LUT5_gc     = (EVSYS_CHANNEL6_CCL_LUT5_gv << EVSYS_CHANNEL6_gp),  /* Configurable Custom Logic LUT5 */
    EVSYS_CHANNEL6_AC0_OUT_gc      = (EVSYS_CHANNEL6_AC0_OUT_gv << EVSYS_CHANNEL6_gp),  /* Analog Comparator 0 out */
    EVSYS_CHANNEL6_AC1_OUT_gc      = (EVSYS_CHANNEL6_AC1_OUT_gv << EVSYS_CHANNEL6_gp),  /* Analog Comparator 1 out */
    EVSYS_CHANNEL6_AC2_OUT_gc      = (EVSYS_CHANNEL6_AC2_OUT_gv << EVSYS_CHANNEL6_gp),  /* Analog Comparator 2 out */
    EVSYS_CHANNEL6_ADC0_RESRDY_gc  = (EVSYS_CHANNEL6_ADC0_RESRDY_gv << EVSYS_CHANNEL6_gp),  /* ADC 0 Result Ready */
    EVSYS_CHANNEL6_PTC_RESRDY_gc   = (EVSYS_CHANNEL6_PTC_RESRDY_gv << EVSYS_CHANNEL6_gp),  /* PTC Result Ready */
    EVSYS_CHANNEL6_ZCD0_gc         = (EVSYS_CHANNEL6_ZCD0_gv << EVSYS_CHANNEL6_gp),  /* Zero Cross Detect 0 out */
    EVSYS_CHANNEL6_ZCD1_gc         = (EVSYS_CHANNEL6_ZCD1_gv << EVSYS_CHANNEL6_gp),  /* Zero Cross Detect 1 out */
    EVSYS_CHANNEL6_USART0_XCK_gc   = (EVSYS_CHANNEL6_USART0_XCK_gv << EVSYS_CHANNEL6_gp),  /* USART 0 XCK */
    EVSYS_CHANNEL6_USART1_XCK_gc   = (EVSYS_CHANNEL6_USART1_XCK_gv << EVSYS_CHANNEL6_gp),  /* USART 1 XCK */
    EVSYS_CHANNEL6_USART2_XCK_gc   = (EVSYS_CHANNEL6_USART2_XCK_gv << EVSYS_CHANNEL6_gp),  /* USART 2 XCK */
    EVSYS_CHANNEL6_USART3_XCK_gc   = (EVSYS_CHANNEL6_USART3_XCK_gv << EVSYS_CHANNEL6_gp),  /* USART 3 XCK */
    EVSYS_CHANNEL6_USART4_XCK_gc   = (EVSYS_CHANNEL6_USART4_XCK_gv << EVSYS_CHANNEL6_gp),  /* USART 4 XCK */
    EVSYS_CHANNEL6_SPI0_SCK_gc     = (EVSYS_CHANNEL6_SPI0_SCK_gv << EVSYS_CHANNEL6_gp),  /* SPI 0 SCK */
    EVSYS_CHANNEL6_SPI1_SCK_gc     = (EVSYS_CHANNEL6_SPI1_SCK_gv << EVSYS_CHANNEL6_gp),  /* SPI 1 SCK */
    EVSYS_CHANNEL6_TCA0_OVF_LUNF_gc = (EVSYS_CHANNEL6_TCA0_OVF_LUNF_gv << EVSYS_CHANNEL6_gp),  /* Timer/Counter A0 overflow / low byte timer underflow */
    EVSYS_CHANNEL6_TCA0_HUNF_gc    = (EVSYS_CHANNEL6_TCA0_HUNF_gv << EVSYS_CHANNEL6_gp),  /* Timer/Counter A0 high byte timer underflow */
    EVSYS_CHANNEL6_TCA0_CMP0_LCMP0_gc = (EVSYS_CHANNEL6_TCA0_CMP0_LCMP0_gv << EVSYS_CHANNEL6_gp),  /* Timer/Counter A0 compare 0 / low byte timer compare 0 */
    EVSYS_CHANNEL6_TCA0_CMP1_LCMP1_gc = (EVSYS_CHANNEL6_TCA0_CMP1_LCMP1_gv << EVSYS_CHANNEL6_gp),  /* Timer/Counter A0 compare 1 / low byte timer compare 1 */
    EVSYS_CHANNEL6_TCA0_CMP2_LCMP2_gc = (EVSYS_CHANNEL6_TCA0_CMP2_LCMP2_gv << EVSYS_CHANNEL6_gp),  /* Timer/Counter A0 compare 2 / low byte timer compare 2 */
    EVSYS_CHANNEL6_TCA1_OVF_LUNF_gc = (EVSYS_CHANNEL6_TCA1_OVF_LUNF_gv << EVSYS_CHANNEL6_gp),  /* Timer/Counter A1 overflow / low byte timer underflow */
    EVSYS_CHANNEL6_TCA1_HUNF_gc    = (EVSYS_CHANNEL6_TCA1_HUNF_gv << EVSYS_CHANNEL6_gp),  /* Timer/Counter A1 high byte timer underflow */
    EVSYS_CHANNEL6_TCA1_CMP0_LCMP0_gc = (EVSYS_CHANNEL6_TCA1_CMP0_LCMP0_gv << EVSYS_CHANNEL6_gp),  /* Timer/Counter A1 compare 0 / low byte timer compare 0 */
    EVSYS_CHANNEL6_TCA1_CMP1_LCMP1_gc = (EVSYS_CHANNEL6_TCA1_CMP1_LCMP1_gv << EVSYS_CHANNEL6_gp),  /* Timer/Counter A1 compare 1 / low byte timer compare 1 */
    EVSYS_CHANNEL6_TCA1_CMP2_LCMP2_gc = (EVSYS_CHANNEL6_TCA1_CMP2_LCMP2_gv << EVSYS_CHANNEL6_gp),  /* Timer/Counter A1 compare 2 / low byte timer compare 2 */
    EVSYS_CHANNEL6_TCB0_CAPT_gc    = (EVSYS_CHANNEL6_TCB0_CAPT_gv << EVSYS_CHANNEL6_gp),  /* Timer/Counter B0 capture */
    EVSYS_CHANNEL6_TCB0_OVF_gc     = (EVSYS_CHANNEL6_TCB0_OVF_gv << EVSYS_CHANNEL6_gp),  /* Timer/Counter B0 overflow */
    EVSYS_CHANNEL6_TCB1_CAPT_gc    = (EVSYS_CHANNEL6_TCB1_CAPT_gv << EVSYS_CHANNEL6_gp),  /* Timer/Counter B1 capture */
    EVSYS_CHANNEL6_TCB1_OVF_gc     = (EVSYS_CHANNEL6_TCB1_OVF_gv << EVSYS_CHANNEL6_gp),  /* Timer/Counter B1 overflow */
    EVSYS_CHANNEL6_TCB2_CAPT_gc    = (EVSYS_CHANNEL6_TCB2_CAPT_gv << EVSYS_CHANNEL6_gp),  /* Timer/Counter B2 capture */
    EVSYS_CHANNEL6_TCB2_OVF_gc     = (EVSYS_CHANNEL6_TCB2_OVF_gv << EVSYS_CHANNEL6_gp),  /* Timer/Counter B2 overflow */
    EVSYS_CHANNEL6_TCB3_CAPT_gc    = (EVSYS_CHANNEL6_TCB3_CAPT_gv << EVSYS_CHANNEL6_gp),  /* Timer/Counter B3 capture */
    EVSYS_CHANNEL6_TCB3_OVF_gc     = (EVSYS_CHANNEL6_TCB3_OVF_gv << EVSYS_CHANNEL6_gp),  /* Timer/Counter B3 overflow */
    EVSYS_CHANNEL6_TCD0_CMPBCLR_gc = (EVSYS_CHANNEL6_TCD0_CMPBCLR_gv << EVSYS_CHANNEL6_gp),  /* Timer/Counter D0 event 0 */
    EVSYS_CHANNEL6_TCD0_CMPASET_gc = (EVSYS_CHANNEL6_TCD0_CMPASET_gv << EVSYS_CHANNEL6_gp),  /* Timer/Counter D0 event 1 */
    EVSYS_CHANNEL6_TCD0_CMPBSET_gc = (EVSYS_CHANNEL6_TCD0_CMPBSET_gv << EVSYS_CHANNEL6_gp),  /* Timer/Counter D0 event 2 */
    EVSYS_CHANNEL6_TCD0_PROGEV_gc  = (EVSYS_CHANNEL6_TCD0_PROGEV_gv << EVSYS_CHANNEL6_gp)   /* Timer/Counter D0 event 3 */
} EVSYS_CHANNEL6_t;

